#include "records.h"
#include <string>

string name[20]
{
	"Стрецький Іван","Стеців Михайло","Бойко Тарас","Козак Василь","Гищак Микола","Блюсович Тарас","Дикий Сергій","Луців Іван","Гнатів Вадим",	"Краївський Руслан",
	"Балита Софія","Сердюк Оксана","Бавус Анастасія","Василик Ірина","Городецька Юлія","Штурхецька Олена","Дуб Марія","Кулик Марта","Кушнір Галина","Яворська Катерина"
};

string position[8]
{
	"Машиніст", "Пакувальник", "Майстровий", "Сортувальник", "Вантажник", "Водій", "Електрик", "Механік"
};

records makeRecordFromSample()
{
	records s;
	s.setName(name[rand() % 20]);
	s.setPosition(position[rand() % 8]);
	int r = 1 + rand() % 7;
	s.setWorkingDays(round(r * 100.0) / 100.0);
	return s;
}
